/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_back_t.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: drafe <drafe@student.42.fr>                +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/07/07 18:53:53 by drafe             #+#    #+#             */
/*   Updated: 2019/07/13 21:31:35 by drafe            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "fillit.h"

/*
** **************************************************************************
**	(1)int	ft_p_a(int m, char min_box[m][m])
**	
** **************************************************************************
*/

int		ft_back_t(int pos, int size, t_crds *all_sh)
{
	int	i;

	i = 0;
	if (pos == size)//очередная перестановка готова
		return (1);
	while (i <= size)//переберем
	{
		if (!all_sh[i].used)//если еще не ставили
		{
			ft_swap_sh(pos, i, all_sh); //поставим(swap)
			all_sh[i].used = 1; //поставим пометку
			ft_back_t(pos + 1, size, all_sh); //сгенерируем остальное
			ft_swap_sh(pos, 0, all_sh);
			all_sh[i].used = 0; //уберем пометку
		}
		i++;
	}
	return (0);
}

/*
** **************************************************************************
**	(1)int	ft_swap_sh(int m, char min_box[m][m])
**	Function swap elements of 
** **************************************************************************
*/

void			ft_swap_sh(int sh_nb1, int sh_nb2, t_crds *all_sh)
{
	t_crds	ptr;

	ptr = all_sh[sh_nb1];
	all_sh[sh_nb1] = all_sh[sh_nb2];
	all_sh[sh_nb2] = ptr;
}